const articles = [
    {
        "title": "Запуск разработки игры «Старины»",
        "date": "2023-07-23",
        "tags": [
            "разработка",
            "игры"
        ],
        "preview": {
            "url": "/static/2023/starines-preprod.png",
            "type": "picture"
        },
        "text": " Начал подготовку к созданию новой игры под рабочим названием «Старины». Будет по-настоящему эпичная пошаговая тактика в атмосфере славянского фентези: сотни юнитов на поле боя, изменение рельефа и разрушения замков, большие монстры помещаются на экран только со стратегического вида."
    },
    {
        "title": "Запуск разработки игры «Старины»",
        "date": "2023-06-14",
        "tags": [
            "отдых",
            "путешествия"
        ],
        "preview": {
            "url": "/static/2023/altai-2.jpg",
            "type": "picture"
        },
        "text": " В молодости, как и многие мои знакомые, я мечтал посетить Исландию или Новую Зеландию из-за магической притягательности природных пейзажей. Но не обязательно лететь так далеко, в России много мест с подобным эффектом. Горный Алатай однозначно в топе."
    },
    {
        "title": "Запуск разработки игры «Старины»",
        "date": "2023-06-13",
        "tags": [
            "отдых",
            "путешествия"
        ],
        "preview": {
            "url": "/static/2023/altai.jpg",
            "type": "picture"
        },
        "text": " Несколько лет думал посетить горный Алтай. Сейчас частные компании вливают деньги в развитие туризма, поэтому не обязательно начинать с диких походов по горам. По реке Катунь расположено много вариантов: от бюджетных турбаз до комфортабельных шале с ресторанами питерского уровня."
    },
    {
        "title": "Питч решения на ЛЦТ 2023",
        "date": "2023-06-11",
        "tags": [
            "разработка",
            "хакатоны",
            "выступления"
        ],
        "preview": {
            "url": "https://www.youtube.com/embed/qJ16vPIZpqc?si=AgNLJohMoRE9Z976&start=1202",
            "type": "youtube"
        },
        "text": " Финал ЛЦТ 2023 проходил в два этапа: в первый день знакомились с экспертами, во второй питч-сессия. Настроение было боевое. Другие команды показали очень крутые решения. Мы объективно заняли второе место и были рады этому."
    },
    {
        "title": "Подготовка для ЛЦТ",
        "date": "2023-05-23",
        "tags": [
            "разработка",
            "хакатоны"
        ],
        "preview": {
            "url": "/static/2023/pipe.gif",
            "type": "gif"
        },
        "text": " Для решения задачи разводки труб канализации в хакатоне ЛЦТ 2023 использовал инверсную кинематику. Модель кинематической цепи идеально описывает профиль подключения сантех приборов к трассе водоотведения, гарантирует точное позиционирование и соосность фитингов и труб."
    },
    {
        "title": "Поездка в Нижний Новгород",
        "date": "2022-05-17",
        "tags": [
            "отдых",
            "путешествия"
        ],
        "preview": {
            "url": "/static/2022/nizhny.jpg",
            "type": "picture"
        },
        "text": " В Нижнем Новгороде карты считают количество лестниц. Мы сначала не поняли, а потом как поняли зачем это нужно во время прогулок. Классный город: обустроенные городские пространства, кремль, крутой ресторан «Экспедиция». В планах попасть как-нибудь на нижегородскую ярмарку."
    },
    {
        "title": "Spacebox",
        "date": "2021-07-02",
        "tags": [
            "разработка",
            "игры",
            "портфолио"
        ],
        "preview": {
            "url": "https://player.vimeo.com/video/581046421?badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479",
            "type": "vimeo"
        },
        "text": " Попытка совместить жанры стратегии и РПГ. Пока один игрок стратегически отправляет корабли к освоению новых планет, второй управляет одним из кораблей, а третий занимается фермерством, обустройством или боевой подготовкой перед высадкой на планету."
    },
    {
        "title": "Поездка в Самару",
        "date": "2021-06-05",
        "tags": [
            "отдых",
            "путешествия"
        ],
        "preview": {
            "url": "/static/2021/samara.jpg",
            "type": "picture"
        },
        "text": " Придумали с друзьями новый формат, коворкинг по городам России. В самую обычную рабочую неделю отправились в Самару. Прекрасный город: исторические и культурные объекты, отличный отель LOTTE, вкусные рестораны и красивая природа в парке «Самарская Лука»."
    },
    {
        "title": "Malva",
        "date": "2018-10-06",
        "tags": [
            "разработка",
            "игры",
            "портфолио"
        ],
        "preview": {
            "url": "https://player.vimeo.com/video/855921050?badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479",
            "type": "vimeo"
        },
        "text": " Фантазии и личные размышления на тему 1917 года. Затянувшаяся мировая война запустила процесс свержения монархии и создания нового правительства. Игрок участвует в этом действии от лица народной партии, которая стремится распространить свое влияние и власть в стране."
    },
    {
        "title": "Brenna",
        "date": "2017-07-01",
        "tags": [
            "разработка",
            "игры",
            "портфолио"
        ],
        "preview": {
            "url": "https://player.vimeo.com/video/235624892?badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479",
            "type": "vimeo"
        },
        "text": " Очередная попытка модернизировать жанр тактических пошаговых сражений. Отсутствие регулярной сетки, интерактивные и квестовые элементы на поле боя, стройная ККИ подобная боевая механика. Впервые использовал покупные ассеты. Это значительно упрощает разработку игр на этапе прототипирования."
    },
    {
        "title": "Railroad",
        "date": "2016-08-24",
        "tags": [
            "разработка",
            "игры",
            "портфолио"
        ],
        "preview": {
            "url": "/static/2016/railroad.jpeg",
            "type": "picture"
        },
        "text": " Тактическая ролевая игра в мире пост апокалиптического СССР 80-х годов. Действие происходит вдоль железнодорожного пути, с узнаваемыми, для любого россиянина, пейзажами. По пути игрок встречает фантастических тварей, продукты деятельности советских НИИ, развалины прежнего режима."
    },
    {
        "title": "Project A",
        "date": "2012-02-12",
        "tags": [
            "разработка",
            "игры",
            "портфолио"
        ],
        "preview": {
            "url": "https://player.vimeo.com/video/58010529?badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479",
            "type": "vimeo"
        },
        "text": " Можно сказать, дипломная работа по итогам нескольких лет обучения на форуме GameDev.ru и завершение попыток делать проекты на голом энтузиазме. Помогла мне устроится на первую работу. Описание реализации клиент-серверного взаимодействия в этом проекте оказалось достаточно, несмотря на нулевое резюме."
    }
]